//===========================
//
//ダイレクトX.playerファイル
//Author:髙山桃也
//
//===========================
#include "main.h"
#include "player.h"
#include "input.h"

//***************************
//グローバル宣言
//***************************
Player g_Player;

//===========================
//プレイヤーの初期化処理
//===========================
void InitPlayer(void)
{
	//各種変数の初期化
	ZeroMemory(&g_Player,sizeof(Player));
}

//===========================
//プレイヤーの終了処理
//===========================
void UninitPlayer(void)
{
}

//===========================
//プレイヤーの更新処理
//===========================
void UpdatePlayer(void)
{
}

//===========================
//プレイヤーの描画処理
//===========================
void DrawPlayer(void)
{
}

//===========================
//プレイヤーの情報取得処理
//===========================
Player *GetPlayer(void)
{
	return &g_Player;
}